CNS/src/Catalogs/ВидыНачислений/ВидыНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНачислений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВзносыВПФР</name>
      <description>Взносы в ПФР</description>
    </items>
    <items>
      <name>ГодоваяПремия</name>
      <description>Годовая премия</description>
    </items>
    <items>
      <name>ДМС</name>
      <description>ДМС</description>
    </items>
    <items>
      <name>ДоплатаЗаФункционалОбразовательнойДеятельности</name>
      <description>Доплата за выполнение работ по функционалу образовательной деятельности</description>
    </items>
    <items>
      <name>ДоплатаЗаПреподаваниеНаИнЯзыке</name>
      <description>Доплата за преподавание на ин. языке на уровне носителя языка</description>
    </items>
    <items>
      <name>ЕжемесячнаяПремия</name>
      <description>Ежемесячная премия</description>
    </items>
    <items>
      <name>Зарплата</name>
      <description>Зарплата</description>
    </items>
    <items>
      <name>КвартальнаяПремия</name>
      <description>Квартальная премия</description>
    </items>
    <items>
      <name>НСиБолезни</name>
      <description>Несчастные случаи и болезни</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ПремияЗаПолугодие</name>
      <description>Премия за полугодие</description>
    </items>
    <items>
      <name>РезервНаСреднийЗаработок</name>
      <description>Резерв на средний заработок, отпуск, командировка, сверхурочные (ежемесячно)</description>
    </items>
    <items>
      <name>СтраховыеВзносыВПФР</name>
      <description>Страховые взносы в ПФР</description>
    </items>
    <items>
      <name>СтраховыеВзносыВФСС</name>
      <description>Страховые взносы в ФСС</description>
    </items>
    <items>
      <name>СтраховыеВзносыВФФОМС</name>
      <description>Страховые взносы в ФФОМС</description>
    </items>
    <items>
      <name>СтраховыхВзносовНаТравматизм</name>
      <description>Страховые взносы на травматизм</description>
    </items>
  </predefined>
  <attributes>
    <name>ЯвляетсяПремией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыплачиваетсяПриНачислении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливаютсяКоэффициенты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВФОТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеПериодыХраненияЗначений</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>EnumRef.ПериодыХраненияЗначений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CNS/src/Catalogs/ВидыНачислений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                   представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	#Область ТабличныйДокументВДеревоЗначений
	
	ТабДокумент							= Справочники.ВидыНачислений.ПолучитьМакет("ПоставляемыеДанные");
	
	ИсточникДанных 						= Новый ОписаниеИсточникаДанных(ТабДокумент.Область(1, 1, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы));
	ПостроительОтчета 					= Новый ПостроительОтчета;
    ПостроительОтчета.ИсточникДанных 	= ИсточникДанных;
    ПостроительОтчета.Выполнить();
	
	ТаблицаПериоды				= ПостроительОтчета.Результат.Выгрузить();	
	ВидыНачислений 				= ТаблицаПериоды.Скопировать();
	ВидыНачислений.Свернуть("Имя");
	
	#КонецОбласти
	
	#Область ОбработкаТаблицыЗначений
	
	Для Каждого СтрокаВидНачисления Из ВидыНачислений Цикл
		
		Попытка
			ВидНачисленийСсылка = Справочники.ВидыНачислений[СтрокаВидНачисления.Имя];
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден предопределенный вид начисления %1", СтрокаВидНачисления.Имя));
			Продолжить;
		КонецПопытки;
		
		СправочникОбъект 	= ВидНачисленийСсылка.ПолучитьОбъект();
		СправочникОбъект.УстанавливаютсяКоэффициенты = Истина;       
		
		СправочникОбъект.ДоступныеПериодыХраненияЗначений.Очистить();
		
		мСтроки 			= ТаблицаПериоды.НайтиСтроки(Новый Структура("Имя", СтрокаВидНачисления.Имя));
		
		Для Каждого СтрокаПериод Из мСтроки Цикл
			НовСтр 			= СправочникОбъект.ДоступныеПериодыХраненияЗначений.Добавить();
			Если ЗначениеЗаполнено(СтрокаПериод.Период) Тогда
				НовСтр.Период 	= Перечисления.ПериодыХраненияЗначений[СтрокаПериод.Период];
			КонецЕсли;	
		КонецЦикла;
		
		СправочникОбъект.Записать();
		
	КонецЦикла;	

	#КонецОбласти

КонецПроцедуры // ЗаполнитьПоставляемыеДанные()

#КонецОбласти

#КонецЕсли
